_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 26, 26)        320       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 13, 26)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 11, 24)        4640      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 5, 24)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1920)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 200)               384200    
_________________________________________________________________
dropout_1 (Dropout)          (None, 200)               0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 200)               800       
_________________________________________________________________
dense_2 (Dense)              (None, 10)                2010      
=================================================================
Total params: 391,970
Trainable params: 391,570
Non-trainable params: 400
_________________________________________________________________
