Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 128, 28, 28)       3328      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 64, 14, 28)        0         
_________________________________________________________________
dropout (Dropout)            (None, 64, 14, 28)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 128, 14, 28)       204928    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 7, 28)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 7, 28)         0         
_________________________________________________________________
flatten (Flatten)            (None, 12544)             0         
_________________________________________________________________
dense (Dense)                (None, 256)               3211520   
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
batch_normalization (BatchNo (None, 256)               1024      
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2570      
=================================================================
Total params: 3,423,370
Trainable params: 3,422,858
Non-trainable params: 512
_________________________________________________________________
