_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 128, 26, 26)       1280      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 13, 26)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 11, 24)       73856     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 64, 5, 24)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 7680)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 50)                384050    
_________________________________________________________________
dropout_1 (Dropout)          (None, 50)                0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 50)                200       
_________________________________________________________________
dense_2 (Dense)              (None, 10)                510       
=================================================================
Total params: 459,896
Trainable params: 459,796
Non-trainable params: 100
_________________________________________________________________
