_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 8, 26, 26)         80        
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 13, 26)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 11, 24)         296       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 5, 24)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 480)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 50)                24050     
_________________________________________________________________
dropout_1 (Dropout)          (None, 50)                0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 50)                200       
_________________________________________________________________
dense_2 (Dense)              (None, 10)                510       
=================================================================
Total params: 25,136
Trainable params: 25,036
Non-trainable params: 100
_________________________________________________________________
