Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 28, 28)        832       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 16, 14, 28)        0         
_________________________________________________________________
dropout (Dropout)            (None, 16, 14, 28)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 32, 14, 28)        12832     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 7, 28)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 16, 7, 28)         0         
_________________________________________________________________
flatten (Flatten)            (None, 3136)              0         
_________________________________________________________________
dense (Dense)                (None, 256)               803072    
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
batch_normalization (BatchNo (None, 256)               1024      
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2570      
=================================================================
Total params: 820,330
Trainable params: 819,818
Non-trainable params: 512
_________________________________________________________________
