_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 64, 28, 28)        1664      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 14, 28)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 14, 28)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 14, 28)        51264     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 7, 28)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 7, 28)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6272)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               1605888   
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 256)               1024      
_________________________________________________________________
dense_2 (Dense)              (None, 10)                2570      
=================================================================
Total params: 1,662,410
Trainable params: 1,661,898
Non-trainable params: 512
_________________________________________________________________
