_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 26, 26)        320       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 13, 26)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 11, 24)        4640      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 5, 24)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1920)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               192100    
_________________________________________________________________
dropout_1 (Dropout)          (None, 100)               0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 100)               400       
_________________________________________________________________
dense_2 (Dense)              (None, 10)                1010      
=================================================================
Total params: 198,470
Trainable params: 198,270
Non-trainable params: 200
_________________________________________________________________
